いくら～ても
～いん
～員
うかがう
うかがう
うける
受ける
うごく
動く
うち
うつ
打つ
うつす
写す
うつる
移る
うまい
うりば
売り場
うれしい
うん
えらぶ
選ぶ
えんりょ・する
遠慮
おいでになる
オートバイ
オーバー
おかげ
おかしい
～おき
おく
億
おくる
送る
おくれる
遅れる
おこさん
お子さん
おこす
起こす
おこなう
行う
おしいれ
押し入れ
おじょうさん
お嬢さん
おたく
お宅
おちる
落ちる
おっしゃる
おっと
夫
おつり
おと
音
おとす
落す
おどり
踊り
おどる
踊る
おどろく
驚く
おみまい
お見舞い
おみやげ
お土産
おもいだす
思い出す
おもう
思う
おもちゃ
おもて
表
おや
親
おりる
下りる
おる
おる
折る
おれい
お礼
おれる
折れる
おわり
終わり
～おわる
～か
～家
カーテン
～かい
～会
かいぎ
会議
かいぎしつ
会議室
かいじょう
会場
かえり
帰り
かえる
変える
～がくぶ
～学部
かける
掛ける
かける
かける
かざる
飾る
ガス
ガソリン
ガソリンスタンド
かた
方
かたい
堅/硬/固い
かたづける
片付ける
かちょう
課長
かつ
勝つ
かっこう
かない
家内
かなしい
悲しい
かならず
必ず
かねもち/おかねもち
お・金持ち
かのじょ
彼女
かべ
壁
かまう
かみ
髪
かむ
噛む
かよう
通う
ガラス
かれ
彼
かれら
彼ら
かわく
乾く
かわり
代わり
かわる
変わる
かんがえる
考える
かんけい
関係
かんごふ
看護婦
かんたん
簡単
がんばる
頑張る
き
気
きかい
機会
きけん
危険
きこえる
聞こえる
きしゃ
汽車
ぎじゅつ
技術
きせつ
季節
きそく
規則
きっと
きぬ
絹
きびしい
厳しい
きまる
決る
きみ
君
きめる
決める
きもち
気持ち
きもの
着物
きゃく
客
きゅう
急
きゅうこう
急行
きょういく
教育
きょうかい
教会
きょうそう
競争
きょうみ
興味
～く
～区
ぐあい
具合
くうき
空気
くうこう
空港
くさ
草
くださる
くび
首
くらべる
比べる
くれる
くれる
暮れる
～くん
～君
け
毛
け
毛
けいかく・する
計画
けいけん・する
経験
けいざい
経済
けいさつ
警察
けが・する
ケーキ
けしき
景色
けしゴム
消しゴム
げしゅく
下宿
けっして
決して
けれど/けれども
～けん
～軒
けんか・する
げんかん
玄関
けんぶつ
見物
こ
子
ご～
御～
こう
こうがい
郊外
こうぎ
講義
こうぎょう
工業
こうこう/こうとうがっこう
高校/高等学校
こうこうせい
高校生
こうじょう
工場
こうちょう
校長
こうつう
交通
こうどう
講堂
こうむいん
公務員
こくさい
国際
～ございます
こしょう・する
故障
ごぞんじ
ご存じ
こたえ
答
ごちそう
こっち
こと
ことり
小鳥
このあいだ
このごろ
こまかい
細かい
ごみ
こむ
込む
こめ
米
ごらんになる
これから
こわす
壊す
こわれる
壊れる
コンサート
こんど
今度
コンピュータ/コンピューター
こんや
今夜
さいきん
最近
さいご
最後
さいしょ
最初
さか
坂
さがす
探す
さがる
下る
さかん
盛ん
さげる
下げる
さしあげる
差し上げる
さっき
さびしい
寂しい
～さま
～様
さらいげつ
さ来月
さらいしゅう
さ来週
サラダ
さわぐ
騒ぐ
さわる
触る
さんぎょう
産業
サンダル
サンドイッチ
ざんねん
残念
しあい
試合
しかる
～しき
～式
しけん
試験
じこ
事故
じしん
地震
じだい
時代
したぎ
下着
したく・する
支度
しっかり
しっぱい
失敗
しつれい
失礼
じてん
辞典
しばらく
しま
島
（～て）しまう
しみん
市民
じむしょ
事務所
しゃかい
社会
しゃちょう
社長
じゃま
ジャム
じゆう
自由
しゅうかん
習慣
じゅうしょ
住所
じゅうどう
柔道
じゅうぶん
十分
しゅっせき・する
出席
しゅっぱつ・する
出発
しゅみ
趣味
じゅんび・する
準備
しょうかい
紹介
しょうがつ
正月
しょうがっこう
小学校
しょうせつ
小説
しょうたい・する
招待
しょうち・する
承知
しょうらい
将来
しょくじ・する
食事
しょくりょうひん
食料品
しらせる
知らせる
しらべる
調べる
じんこう
人口
じんじゃ
神社
しんせつ
親切
しんぱい・する
心配
しんぶんしゃ
新聞社
すいえい
水泳
すいどう
水道
ずいぶん
すうがく
数学
スーツ
スーツケース
スーパー（マーケット）
すぎる
過ぎる
すく
すく
スクリーン
すごい
凄い
すすむ
進む
すっかり
ステーキ
ステレオ
すてる
捨てる
すな
砂
すばらしい
すべる
滑る
すみ
隅
すむ
済む
すり
すると
～せい
～製
せいかつ・する
生活
せいさん・する
生産
せいじ
政治
せいよう
西洋
せかい
世界
せき
席
せつめい
説明
せなか
背中
ぜひ
せわ・する
世話
せん
線
ぜんぜん
せんそう
戦争
せんぱい
先輩
せんもん
専門
そう
そうだん・する
相談
そだてる
育てる
そつぎょう
卒業
そふ
祖父
ソフト
そぼ
祖母
それで
それに
それほど
そろそろ
そんな
そんなに
～だい
～代
たいいん・する
退院
だいがくせい
大学生
だいじ
大事
だいたい
大体
たいてい
タイプ
だいぶ
大分
たいふう
台風
たおれる
倒れる
だから
たしか
確か
たす
足す
～だす
たずねる
訪ねる
たずねる
尋ねる
ただしい
正しい
たたみ
畳
～だて
建て
たてる
立てる
たてる
建てる
たとえば
例えば
たな
棚
たのしむ
楽む
たのしみ
楽しみ
たまに
ため
為
だめ
だんぼう
暖房
ち
血
チェック・する
ちっとも
～ちゃん
ちゅうい
注意
ちゅうがっこう
中学校
ちゅうしゃ
注射
ちゅうしゃじょう
駐車場
～ちょう
～町
ちり
地理
～（に）ついて
つかまえる
捕まえる
つき
～つき
～月
つく
点く
つける
つける
漬ける
つごう
都合
つたえる
伝える
つづく
続く
～つづける
～続ける
つづける
続ける
つつむ
包む
つる
釣る
つれる
連れる
ていねい
丁寧
テキスト
てきとう
適当
できる
できるだけ
てつだう
手伝う
テニス
てぶくろ
手袋
てら
寺
てん
点
てんいん
店員
てんきよほう
天気予報
でんとう
電灯
でんぽう
電報
てんらんかい
展覧会
と
都
どうぐ
道具
とうとう
どうぶつえん
動物園
とおく
遠く
とこや
とちゅう
途中
とっきゅう
特急
とまる
泊まる
とめる
止める
どろぼう
泥棒
どんどん
なおす
直す
なおる
直る
なおる
治る
なかなか
中々
なく
泣く
なくなる
無くなる
なくなる
亡くなる
なげる
投げる
なさる
なる
鳴る
なるべく
なるほど
なれる
慣れる
におい
にがい
苦い
～にくい
にげる
逃げる
にっき
日記
にゅういん・する
入院
にゅうがく・する
入学
にる
似る
にんぎょう
人形
ぬすむ
盗む
ぬる
塗る
ぬれる
ねだん
ねつ
熱
ねっしん
ねぼう
寝坊
ねむい
眠い
ねむる
眠る
のこる
残る
のど
のりかえる
乗り換える
のりもの
乗り物
は
葉
ばあい
場合
パート（タイム）
ばい
倍
はいけん・する
拝見
はいしゃ
歯医者
～ばかり
はこぶ
運ぶ
～はじめる
～始める
はじめる
始める
ばしょ
場所
はず
はずかしい
恥ずかしい
パソコン
はつおん
発音
はっきり
はなみ
花見
パパ
はらう
払う
ばんぐみ
番組
はんたい
反対
ハンバーグ
ひ
日
ひ
火
ピアノ
ひえる
冷える
ひかる
光る
ひかり
光
ひきだし
引き出し
ひげ
ひこうじょう
飛行場
ひさしぶり
久しぶり
びじゅつかん
美術館
びっくりする
ひっこす
引っ越す
ひつよう
必要
ひどい
ひらく
開く
ビル
ひるま
昼間
ひるやすみ
昼休み
ひろう
拾う
ファックス
ふえる
増える
ふかい
深い
ふくざつ
複雑
ふくしゅう
復習
ぶちょう
部長
ふつう
普通
ぶどう
ふとる
太る
ふとん
布団
ふべん
不便
ふむ
踏む
プレゼント
ぶんか
文化
ぶんがく
文学
ぶんぽう
文法
べつ
別
ベル
へん
変
へんじ
返事
ぼうえき
貿易
ほうそう・する
放送
ほうりつ
法律
ぼく
僕
ほし
星
ほど
ほとんど
ほめる
ほんやく
翻訳
まいる
参る
まける
負ける
まじめ
まず
または
まちがえる
間違える
まにあう
間に合う
～まま
まわる
回る
まんが
漫画
まんなか
真中
みずうみ
湖
みそ
味噌
みつかる
見つかる
みつける
見つける
みな
港
むかえる
迎える
むり
無理
～め
～目
めしあがる
召し上がる
めずらしい
珍しい
もうしあげる
申し上げる
もうす
申す
もうすぐ
もし
もちろん
もっとも
もどる
戻る
もめん
木綿
もらう
やく
焼く
やくにたつ
役に立つ
やくそく
約束
やける
焼ける
やさしい
優しい
～やすい
やせる
やっと
やはり/やっぱり
やむ
やめる
止める
ゆ
湯
ゆうはん
夕飯
ゆしゅつ・する
輸出
ゆび
指
ゆびわ
指輪
ゆれる
揺れる
よう
様
ようじ
用事
よごれる
汚れる
よしゅう
予習
よる
寄る
（～に）よると
よろしい
りゆう
理由
りよう
利用
りょうほう
両方
りょかん
旅館
るす
留守
冷房
れきし
歴史
レジ
レポート/リポート
れんらく
連絡
ワープロ
わかす
沸かす
わかれる
別れる
わく
沸く
わけ
訳
わりあい
割合
われる
割れる"
output = temp1.join("\n")
"あ
ああ
あいさつ・する
あいだ
間
あう
合う
あかちゃん
あがる
上がる
あかんぼう
赤ん坊
あく
空く
アクセサリー
あじ
味
アジア
アフリカ
アメリカ
あんしん
安心
あんぜん
安全
いくら～ても
いし
石
～いん
～員
うかがう
うかがう
うける
受ける
うごく
動く
うち
うつ
打つ
うつす
写す
うつる
移る
うまい
うりば
売り場
うれしい
うん
えらぶ
選ぶ
えんりょ・する
遠慮
おいでになる
オートバイ
オーバー
おかげ
おかしい
～おき
おく
億
おくる
送る
おくれる
遅れる
おこさん
お子さん
おこす
起こす
おこなう
行う
おしいれ
押し入れ
おじょうさん
お嬢さん
おたく
お宅
おちる
落ちる
おっしゃる
おっと
夫
おつり
おと
音
おとす
落す
おどり
踊り
おどる
踊る
おどろく
驚く
おみまい
お見舞い
おみやげ
お土産
おもいだす
思い出す
おもう
思う
おもちゃ
おもて
表
おや
親
おりる
下りる
おる
おる
折る
おれい
お礼
おれる
折れる
おわり
終わり
～おわる
～か
～家
カーテン
～かい
～会
かいぎ
会議
かいぎしつ
会議室
かいじょう
会場
かえり
帰り
かえる
変える
～がくぶ
～学部
かける
掛ける
かける
かける
かざる
飾る
ガス
ガソリン
ガソリンスタンド
かた
方
かたい
堅/硬/固い
かたづける
片付ける
かちょう
課長
かつ
勝つ
かっこう
かない
家内
かなしい
悲しい
かならず
必ず
かねもち/おかねもち
お・金持ち
かのじょ
彼女
かべ
壁
かまう
かみ
髪
かむ
噛む
かよう
通う
ガラス
かれ
彼
かれら
彼ら
かわく
乾く
かわり
代わり
かわる
変わる
かんがえる
考える
かんけい
関係
かんごふ
看護婦
かんたん
簡単
がんばる
頑張る
き
気
きかい
機会
きけん
危険
きこえる
聞こえる
きしゃ
汽車
ぎじゅつ
技術
きせつ
季節
きそく
規則
きっと
きぬ
絹
きびしい
厳しい
きまる
決る
きみ
君
きめる
決める
きもち
気持ち
きもの
着物
きゃく
客
きゅう
急
きゅうこう
急行
きょういく
教育
きょうかい
教会
きょうそう
競争
きょうみ
興味
～く
～区
ぐあい
具合
くうき
空気
くうこう
空港
くさ
草
くださる
くび
首
くらべる
比べる
くれる
くれる
暮れる
～くん
～君
け
毛
け
毛
けいかく・する
計画
けいけん・する
経験
けいざい
経済
けいさつ
警察
けが・する
ケーキ
けしき
景色
けしゴム
消しゴム
げしゅく
下宿
けっして
決して
けれど/けれども
～けん
～軒
けんか・する
げんかん
玄関
けんぶつ
見物
こ
子
ご～
御～
こう
こうがい
郊外
こうぎ
講義
こうぎょう
工業
こうこう/こうとうがっこう
高校/高等学校
こうこうせい
高校生
こうじょう
工場
こうちょう
校長
こうつう
交通
こうどう
講堂
こうむいん
公務員
こくさい
国際
～ございます
こしょう・する
故障
ごぞんじ
ご存じ
こたえ
答
ごちそう
こっち
こと
ことり
小鳥
このあいだ
このごろ
こまかい
細かい
ごみ
こむ
込む
こめ
米
ごらんになる
これから
こわす
壊す
こわれる
壊れる
コンサート
こんど
今度
コンピュータ/コンピューター
こんや
今夜
さいきん
最近
さいご
最後
さいしょ
最初
さか
坂
さがす
探す
さがる
下る
さかん
盛ん
さげる
下げる
さしあげる
差し上げる
さっき
さびしい
寂しい
～さま
～様
さらいげつ
さ来月
さらいしゅう
さ来週
サラダ
さわぐ
騒ぐ
さわる
触る
さんぎょう
産業
サンダル
サンドイッチ
ざんねん
残念
しあい
試合
しかる
～しき
～式
しけん
試験
じこ
事故
じしん
地震
じだい
時代
したぎ
下着
したく・する
支度
しっかり
しっぱい
失敗
しつれい
失礼
じてん
辞典
しばらく
しま
島
（～て）しまう
しみん
市民
じむしょ
事務所
しゃかい
社会
しゃちょう
社長
じゃま
ジャム
じゆう
自由
しゅうかん
習慣
じゅうしょ
住所
じゅうどう
柔道
じゅうぶん
十分
しゅっせき・する
出席
しゅっぱつ・する
出発
しゅみ
趣味
じゅんび・する
準備
しょうかい
紹介
しょうがつ
正月
しょうがっこう
小学校
しょうせつ
小説
しょうたい・する
招待
しょうち・する
承知
しょうらい
将来
しょくじ・する
食事
しょくりょうひん
食料品
しらせる
知らせる
しらべる
調べる
じんこう
人口
じんじゃ
神社
しんせつ
親切
しんぱい・する
心配
しんぶんしゃ
新聞社
すいえい
水泳
すいどう
水道
ずいぶん
すうがく
数学
スーツ
スーツケース
スーパー（マーケット）
すぎる
過ぎる
すく
すく
スクリーン
すごい
凄い
すすむ
進む
すっかり
ステーキ
ステレオ
すてる
捨てる
すな
砂
すばらしい
すべる
滑る
すみ
隅
すむ
済む
すり
すると
～せい
～製
せいかつ・する
生活
せいさん・する
生産
せいじ
政治
せいよう
西洋
せかい
世界
せき
席
せつめい
説明
せなか
背中
ぜひ
せわ・する
世話
せん
線
ぜんぜん
せんそう
戦争
せんぱい
先輩
せんもん
専門
そう
そうだん・する
相談
そだてる
育てる
そつぎょう
卒業
そふ
祖父
ソフト
そぼ
祖母
それで
それに
それほど
そろそろ
そんな
そんなに
～だい
～代
たいいん・する
退院
だいがくせい
大学生
だいじ
大事
だいたい
大体
たいてい
タイプ
だいぶ
大分
たいふう
台風
たおれる
倒れる
だから
たしか
確か
たす
足す
～だす
たずねる
訪ねる
たずねる
尋ねる
ただしい
正しい
たたみ
畳
～だて
建て
たてる
立てる
たてる
建てる
たとえば
例えば
たな
棚
たのしむ
楽む
たのしみ
楽しみ
たまに
ため
為
だめ
だんぼう
暖房
ち
血
チェック・する
ちっとも
～ちゃん
ちゅうい
注意
ちゅうがっこう
中学校
ちゅうしゃ
注射
ちゅうしゃじょう
駐車場
～ちょう
～町
ちり
地理
～（に）ついて
つかまえる
捕まえる
つき
～つき
～月
つく
点く
つける
つける
漬ける
つごう
都合
つたえる
伝える
つづく
続く
～つづける
～続ける
つづける
続ける
つつむ
包む
つる
釣る
つれる
連れる
ていねい
丁寧
テキスト
てきとう
適当
できる
できるだけ
てつだう
手伝う
テニス
てぶくろ
手袋
てら
寺
てん
点
てんいん
店員
てんきよほう
天気予報
でんとう
電灯
でんぽう
電報
てんらんかい
展覧会
と
都
どうぐ
道具
とうとう
どうぶつえん
動物園
とおく
遠く
とこや
とちゅう
途中
とっきゅう
特急
とまる
泊まる
とめる
止める
どろぼう
泥棒
どんどん
なおす
直す
なおる
直る
なおる
治る
なかなか
中々
なく
泣く
なくなる
無くなる
なくなる
亡くなる
なげる
投げる
なさる
なる
鳴る
なるべく
なるほど
なれる
慣れる
におい
にがい
苦い
～にくい
にげる
逃げる
にっき
日記
にゅういん・する
入院
にゅうがく・する
入学
にる
似る
にんぎょう
人形
ぬすむ
盗む
ぬる
塗る
ぬれる
ねだん
ねつ
熱
ねっしん
ねぼう
寝坊
ねむい
眠い
ねむる
眠る
のこる
残る
のど
のりかえる
乗り換える
のりもの
乗り物
は
葉
ばあい
場合
パート（タイム）
ばい
倍
はいけん・する
拝見
はいしゃ
歯医者
～ばかり
はこぶ
運ぶ
～はじめる
～始める
はじめる
始める
ばしょ
場所
はず
はずかしい
恥ずかしい
パソコン
はつおん
発音
はっきり
はなみ
花見
パパ
はらう
払う
ばんぐみ
番組
はんたい
反対
ハンバーグ
ひ
日
ひ
火
ピアノ
ひえる
冷える
ひかる
光る
ひかり
光
ひきだし
引き出し
ひげ
ひこうじょう
飛行場
ひさしぶり
久しぶり
びじゅつかん
美術館
びっくりする
ひっこす
引っ越す
ひつよう
必要
ひどい
ひらく
開く
ビル
ひるま
昼間
ひるやすみ
昼休み
ひろう
拾う
ファックス
ふえる
増える
ふかい
深い
ふくざつ
複雑
ふくしゅう
復習
ぶちょう
部長
ふつう
普通
ぶどう
ふとる
太る
ふとん
布団
ふべん
不便
ふむ
踏む
プレゼント
ぶんか
文化
ぶんがく
文学
ぶんぽう
文法
べつ
別
ベル
へん
変
へんじ
返事
ぼうえき
貿易
ほうそう・する
放送
ほうりつ
法律
ぼく
僕
ほし
星
ほど
ほとんど
ほめる
ほんやく
翻訳
まいる
参る
まける
負ける
まじめ
まず
または
まちがえる
間違える
まにあう
間に合う
～まま
まわる
回る
まんが
漫画
まんなか
真中
みずうみ
湖
みそ
味噌
みつかる
見つかる
みつける
見つける
みな
港
むかえる
迎える
むり
無理
～め
～目
めしあがる
召し上がる
めずらしい
珍しい
もうしあげる
申し上げる
もうす
申す
もうすぐ
もし
もちろん
もっとも
もどる
戻る
もめん
木綿
もらう
やく
焼く
やくにたつ
役に立つ
やくそく
約束
やける
焼ける
やさしい
優しい
～やすい
やせる
やっと
やはり/やっぱり
やむ
やめる
止める
ゆ
湯
ゆうはん
夕飯
ゆしゅつ・する
輸出
ゆび
指
ゆびわ
指輪
ゆれる
揺れる
よう
様
ようじ
用事
よごれる
汚れる
よしゅう
予習
よる
寄る
（～に）よると
よろしい
りゆう
理由
りよう
利用
りょうほう
両方
りょかん
旅館
るす
留守
れきし
歴史
レジ
レポート/リポート
れんらく
連絡
ワープロ
わかす
沸かす
わかれる
別れる
わく
沸く
わけ
訳
わりあい
割合
われる
割れる
