# This is a list of Wanikani vocab I have learned thus far
# Taken from wkstats.com and parsed with Google Docs.
ふじ山
一
一つ
一人
七
七つ
三
三つ
三人
上
上がる
上げる
上る
下
下がる
下げる
下さい
九
九つ
二
二つ
二人
人
人口
人工
入り口
入る
入れる
八
八つ
力
十
口
大きい
大きさ
大した
大人
女
山
川
〜円
〜才
一千
一日
一月
七日
三日
上手
下手
中
中々
丸
丸い
九日
二日
二月
五
五つ
五十
五日
五月
人々
入力
八日
六
六つ
六日
六月
円い
出す
出る
出口
刀
十六
十日
十月
千
千円
又
右
四
四月
土
夕べ
大いに
天
天才
女の子
女子
女王
子
子犬
小さい
左
左右
手
文
日
日本
月
木
本
正しい
正す
水
水中
火
火山
犬
玉
玉ねぎ
王
王女
王子
田
白
白人
目
目玉
立つ
立てる
〜人
〜台
アメリカ人
お母さん
お父さん
シアトル市
ビー玉
フランス人
一万
一台
万
中古
中止
二万
二台
五台
人生
今
今日
今日は
今月
元
公用
内
冬
分
分かる
分ける
切る
切れる
北
十万
十台
半
半分
友人
古い
外
外れ
外れる
外人
大人しい
大切
太い
太る
女の人
少し
少ない
少女
市
市立
広い
引く
心
戸
戸口
方
止まる
止める
母
毛
父
牛
生
生きる
生まれる
生む
用
用いる
矢
２０１１年
お礼
かき氷
一代
一年生
一打
一文字
一本気
一気
三世
不正
不足
世
中央
丸ごと
主に
主人
二世
二十日
二百
五百
人気
仕方
他
他人
代わる
代用
休み
休む
休日
休止
元気
先
先々月
先ず
先日
先月
先生
写す
写る
出かける
切手
去年
右手
号
名
名人
名字
四つ
四十
四千
四日
四百
大気
天気
太字
子牛
字
宝
宝石
小皿
少年
左手
平ら
平日
平気
年
年中
年内
引き分け
打つ
文字
早々
早い
月見
本気
村
村人
気
気に入る
気分
氷
申し申し
申す
男
町
白い
百
百万
皿
石
竹
竹の子
糸
耳
花
花火
花見
虫
見える
見せる
見る
見分ける
見方
貝
赤
赤い
赤ちゃん
足
足りる
車
車内
〜回
〜年来
〜形
お金
一回
一生
万人
三角
下町
交ぜる
今すぐ
今まで
今回
仕草
休学
会
会う
会社
体
体内
体力
何
何人
何千
何回
何年
何日
何月
作る
作文
作用
兄
兄弟
光
光年
入学
入社
公社
北西
古来
同じ
同日
四角
回る
図
声
外交
外来
多い
多分
大会
大体
大作
大声
大学
学ぶ
学年
学生
工作
工学
弟
当たり
当たる
文学
日光
月光
本当
本来
本社
来る
来年
来月
林
毎回
毎年
毎日
毎月
毛糸
毛虫
水色
牛肉
生える
生まれ
男の人
男の子
皮
皮肉
社内
空
空気
空車
米
羽
考える
考古学
肉
自分
自立
色
色々
草
行う
行き
行く
西
角
言う
谷
走る
走行
近い
近年
近日
里
里心
金
金玉
雨
青い
青年
音
麦
〜室
お姉さん
お茶
一歩
三百
不安
不明
世の中
両手
両方
両日
中国
中東
九州
亡くなる
今夜
今年
仕方がない
代える
代わり
全て
全力
全国
全日本
冬休み
出来る
出血
前
午前
午後
南
南東
名曲
向く
四十二
四国
国
国宝
国王
土地
土星
地
地下
地中
地図
外国
外国人
夜
大文字
天国
妹
姉
姉妹
安い
安全
安心
宝くじ
小文字
州
平安
年上
年下
年次
店
後で
後ろ
思う
手首
文化
方向
方言
早く
早口
明るい
星
曲
有る
有名
本州
東
東京
東北
東方
次
次回
正直
歩く
死
死ぬ
死亡
死体
水星
活気
活用
海
海外
海王星
点
生活
目次
直す
直る
直行
知る
社長
私
私生活
私立
科学
米国
羊
羊毛
耳打ち
茶色
草地
血
足す
足りない
足首
車両
金星
長い
食べる
首
首になる
〜丁目
〜号室
〜時
〜札
お兄さん
この辺
一体
一時
三角形
不人気
中学生
二時半
交通
人形
今週
付ける
以上
以下
以前
以外
以後
何時
作り方
作家
先回り
先週
光る
台風
同時
国民
地理
夏
夏休み
大きく
大学生
大空
失う
失礼
学校
家
小声
小学生
年末
弱い
弱点
強い
強力
形
心理
心理学
必ず
必死
手作り
手紙
教える
教室
日記
時
時代
月末
未だ
未来
末
本当に
札
来週
欠ける
欠点
氏
氏名
活用形
海魚
理由
町民
白鳥
社会
紙
組
考え
考え方
自由
船
船体
見当たる
言い方
辺
辺り
近々
近く
通る
週末
金魚
雪
青空
風
風船
高い
高校
魚
鳥
黄色
黒い
黒人
〜君
〜道
〜間
お前
お知らせ
この前
一番
両者
二番
交じる
交わる
交番
人数
人間
他所
会話
住む
住人
住所
作者
入場
入所
全く
全米
全身
出所
出来上がる
前回
助ける
助力
助言
化ける
北海道
医大
医学
医者
南口
南米
反対
名前
名所
向ける
向こう
君
君主国
回す
地上
地中海
場所
大役
学者
対する
対外
対立
局
工場
工学者
当たり前
当てる
役
役に立つ
役人
役目
心身
思い出
思い出す
所
投げる
投手
支える
支局
支店
数
数える
数字
数学
数年
明日
時間
曲がる
曲げる
朝
朝ごはん
朝日
未決
東口
森
楽
楽しい
次々
歩道
毎朝
水道
池
決
決める
決心
点ける
点数
生地
番号
番組
研究
私立大学
私自身
科目
究明
空間
答え
答える
絵
絵文字
自決
見直す
話す
買う
走り回る
身
身体
近づく
道
長さ
間
間もなく
雲
電力
電子
電気
電池
電話
電車
音楽
馬
馬力
〜屋
〜度
〜県
〜部
お客さん
ハート形
丁度
不自由
世界
中学校
乗せる
乗る
予定
事
事実
二重
今度
付く
付近
仮に
仮名
仮定
住民
体重
体験
何度
使う
使用
保つ
保持
全部
出発
勝つ
勝者
勝負
千円札
受ける
受験
名古屋
名物
和室
和服
和風
和食
売る
売れる
大事
天使
実
実力
実験
客室
家事
家具
対談
小学校
工事
平和
弱々しい
弱虫
必勝
必要
持つ
教え
新しい
新年
服
本屋
楽勝
欠かす
毎度
気を付けて
決定
泳ぎ
泳ぐ
火事
物
生保
生物
用事
発売
発表
発見
発音
白黒
相手
相談
美しい
美人
肉屋
苦い
苦しい
茶屋
表
表す
要る
要点
見付ける
見物
角度
記事
試みる
試食
試験
負ける
返す
返事
送る
通す
通り
道具
部分
部室
部屋
部首
重い
重要
食事
高さ
高校生
魚屋
